bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA8E5.xml
                <register caption="Device ID byte 2" name="DEVID2" offset="0x02" size="1"/>
                <register caption="Revision ID" name="REVID" offset="0x03" size="1"/>
                <register caption="Analog Startup Delay" name="ANAINIT" offset="0x07" size="1">
                    <bitfield caption="Analog startup delay Port A" mask="0x03" name="STARTUPDLYA"/>
                </register>
                <register caption="Event System Lock" name="EVSYSLOCK" offset="0x08" size="1">
                    <bitfield caption="Event Channel 4-7 Lock" mask="0x10" name="EVSYS1LOCK"/>
                    <bitfield caption="Event Channel 0-3 Lock" mask="0x01" name="EVSYS0LOCK"/>
                </register>
                <register caption="WEX Lock" name="WEXLOCK" offset="0x09" size="1">
                    <bitfield caption="WeX on T/C C4 Lock" mask="0x01" name="WEXCLOCK"/>
                </register>
                <register caption="FAULT Lock" name="FAULTLOCK" offset="0x0A" size="1">
                    <bitfield caption="Fault on T/C C5 Lock" mask="0x02" name="FAULTC5LOCK"/>
                    <bitfield caption="Fault on T/C C4 Lock" mask="0x01" name="FAULTC4LOCK"/>
                </register>
            </register-group>
        </module>
        <module name="PMIC" caption="Programmable Multi-level Interrupt Controller" id="I6057">
            <register-group name="PMIC" caption="Programmable Multi-level Interrupt Controller" size="16">
                <register name="STATUS" caption="Status Register" size="1" offset="0x00">
                    <bitfield name="NMIEX" caption="Non-maskable Interrupt Executing" mask="0x80"/>
                    <bitfield name="HILVLEX" caption="High Level Interrupt Executing" mask="0x04"/>
                    <bitfield name="MEDLVLEX" caption="Medium Level Interrupt Executing" mask="0x02"/>
                    <bitfield name="LOLVLEX" caption="Low Level Interrupt Executing" mask="0x01"/>
                </register>
                <register name="INTPRI" caption="Interrupt Priority" size="1" offset="0x01">
                    <bitfield name="INTPRI" caption="Interrupt Priority" mask="0xFF"/>
                </register>
                <register name="CTRL" caption="Control Register" size="1" offset="0x02">
                    <bitfield name="RREN" caption="Round-Robin Priority Enable" mask="0x80"/>
                    <bitfield name="IVSEL" caption="Interrupt Vector Select" mask="0x40"/>
                    <bitfield name="HILVLEN" caption="High Level Enable" mask="0x04"/>
                    <bitfield name="MEDLVLEN" caption="Medium Level Enable" mask="0x02"/>
                    <bitfield name="LOLVLEN" caption="Low Level Enable" mask="0x01"/>
                </register>
            </register-group>
        </module>
        <module name="PORTCFG" id="I6075" version="XMEGAE" caption="Port Configuration">
            <register-group caption="I/O port Configuration" name="PORTCFG" size="8">
                <register caption="Multi-pin Configuration Mask" name="MPCMASK" offset="0x00" size="1"/>
                <register caption="Clock Out Register" name="CLKOUT" offset="0x04" size="1">
                    <bitfield caption="Clock and Event Output Pin Select" mask="0x80" name="CLKEVPIN"
                              values="PORTCFG_CLKEVPIN"/>
                    <bitfield caption="RTC Clock Output Enable" mask="0x60" name="RTCOUT" values="PORTCFG_RTCCLKOUT"/>
                    <bitfield caption="Clock Output Select" mask="0x0C" name="CLKOUTSEL" values="PORTCFG_CLKOUTSEL"/>
                    <bitfield caption="Clock Output Port" mask="0x03" name="CLKOUT" values="PORTCFG_CLKOUT"/>
                </register>
                <register caption="Analog Comparator and Event Out Register" name="ACEVOUT" offset="0x06" size="1">
                    <bitfield caption="Analog Comparator Output Port" mask="0xC0" name="ACOUT" values="PORTCFG_ACOUT"/>
                    <bitfield caption="Event Channel Output Port" mask="0x30" name="EVOUT" values="PORTCFG_EVOUT"/>
                    <bitfield caption="Asynchronous Event Enabled" mask="0x08" name="EVASYEN"/>
                    <bitfield caption="Event Channel Output Selection" mask="0x07" name="EVOUTSEL"
                              values="PORTCFG_EVOUTSEL"/>
                </register>
                <register caption="Slew Rate Limit Control Register" name="SRLCTRL" offset="0x07" size="1">
                    <bitfield caption="Slew Rate Limit Enable on PORTA" mask="0x01" name="SRLENRA"/>
                    <bitfield caption="Slew Rate Limit Enable on PORTC" mask="0x04" name="SRLENRC"/>
                    <bitfield caption="Slew Rate Limit Enable on PORTD" mask="0x08" name="SRLENRD"/>
                    <bitfield caption="Slew Rate Limit Enable on PORTR" mask="0x80" name="SRLENRR"/>
                </register>
            </register-group>
            <value-group caption="Clock and Event Output Port" name="PORTCFG_CLKEVPIN">
                <value caption="Clock and Event Output on PIN 7" name="PIN7" value="0x00"/>
                <value caption="Clock and Event Output on PIN 4" name="PIN4" value="0x01"/>
            </value-group>
            <value-group caption="RTC Clock Output Port" name="PORTCFG_RTCCLKOUT">
                <value caption="System Clock Output Disabled" name="OFF" value="0x00"/>
                <value caption="System Clock Output on Port C pin 6" name="PC6" value="0x01"/>
                <value caption="System Clock Output on Port D pin 6" name="PD6" value="0x02"/>
                <value caption="System Clock Output on Port R pin 0" name="PR0" value="0x03"/>
            </value-group>
            <value-group caption="Peripheral Clock Output Select" name="PORTCFG_CLKOUTSEL">
                <value caption="1x Peripheral Clock Output to pin" name="CLK1X" value="0x00"/>
                <value caption="2x Peripheral Clock Output to pin" name="CLK2X" value="0x01"/>
                <value caption="4x Peripheral Clock Output to pin" name="CLK4X" value="0x02"/>
            </value-group>
            <value-group caption="System Clock Output Port" name="PORTCFG_CLKOUT">
                <value caption="System Clock Output Disabled" name="OFF" value="0x00"/>
                <value caption="System Clock Output on Port C pin 7" name="PC7" value="0x01"/>
                <value caption="System Clock Output on Port D pin 7" name="PD7" value="0x02"/>
                <value caption="System Clock Output on Port R pin 0" name="PR0" value="0x03"/>
            </value-group>
            <value-group caption="Analog Comparator Output Port" name="PORTCFG_ACOUT">
                <value caption="Analog Comparator Outputs on Port A, Pin 6-7" name="PA" value="0x00"/>
                <value caption="Analog Comparator Outputs on Port C, Pin 6-7" name="PC" value="0x01"/>
                <value caption="Analog Comparator Outputs on Port D, Pin 6-7" name="PD" value="0x02"/>
                <value caption="Analog Comparator Outputs on Port R, Pin 0-1" name="PR" value="0x03"/>
            </value-group>
