bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA8E5.xml
            <value-group caption="Event Output Port" name="PORTCFG_EVOUT">
                <value caption="Event Output Disabled" name="OFF" value="0x00"/>
                <value caption="Event Channel n Output on Port C pin 7" name="PC7" value="0x01"/>
                <value caption="Event Channel n Output on Port D pin 7" name="PD7" value="0x02"/>
                <value caption="Event Channel n Output on Port R pin 0" name="PR0" value="0x03"/>
            </value-group>
            <value-group caption="Event Output Select" name="PORTCFG_EVOUTSEL">
                <value caption="Event Channel 0 output to pin" name="0" value="0x00"/>
                <value caption="Event Channel 1 output to pin" name="1" value="0x01"/>
                <value caption="Event Channel 2 output to pin" name="2" value="0x02"/>
                <value caption="Event Channel 3 output to pin" name="3" value="0x03"/>
                <value caption="Event Channel 4 output to pin" name="4" value="0x04"/>
                <value caption="Event Channel 5 output to pin" name="5" value="0x05"/>
                <value caption="Event Channel 6 output to pin" name="6" value="0x06"/>
                <value caption="Event Channel 7 output to pin" name="7" value="0x07"/>
            </value-group>
        </module>
        <module name="CRC" id="I6111" version="XMEGAAU" caption="Cyclic Redundancy Checker">
            <register-group caption="Cyclic Redundancy Checker" name="CRC" size="8">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Reset" mask="0xC0" name="RESET" values="CRC_RESET"/>
                    <bitfield caption="CRC Mode" mask="0x20" name="CRC32"/>
                    <bitfield caption="Input Source" mask="0x0F" name="SOURCE" values="CRC_SOURCE"/>
                </register>
                <register caption="Status Register" name="STATUS" offset="0x01" size="1">
                    <bitfield caption="Zero detection" mask="0x02" name="ZERO"/>
                    <bitfield caption="Busy" mask="0x01" name="BUSY"/>
                </register>
                <register caption="Data Input" name="DATAIN" offset="0x03" size="1"/>
                <register caption="Checksum byte 0" name="CHECKSUM0" offset="0x04" size="1"/>
                <register caption="Checksum byte 1" name="CHECKSUM1" offset="0x05" size="1"/>
                <register caption="Checksum byte 2" name="CHECKSUM2" offset="0x06" size="1"/>
                <register caption="Checksum byte 3" name="CHECKSUM3" offset="0x07" size="1"/>
            </register-group>
            <value-group caption="Reset" name="CRC_RESET">
                <value caption="No Reset" name="NO" value="0x00"/>
                <value caption="Reset CRC with CHECKSUM to all zeros" name="RESET0" value="0x02"/>
                <value caption="Reset CRC with CHECKSUM to all ones" name="RESET1" value="0x03"/>
            </value-group>
            <value-group caption="Input Source" name="CRC_SOURCE">
                <value caption="Disabled" name="DISABLE" value="0x00"/>
                <value caption="I/O Interface" name="IO" value="0x01"/>
                <value caption="Flash" name="FLASH" value="0x02"/>
                <value caption="DMAC Channel 0" name="DMAC0" value="0x04"/>
                <value caption="DMAC Channel 1" name="DMAC1" value="0x05"/>
                <value caption="DMAC Channel 2" name="DMAC2" value="0x06"/>
                <value caption="DMAC Channel 3" name="DMAC3" value="0x07"/>
            </value-group>
        </module>
        <module name="EDMA" id="I3002" version="XMEGAE" caption="Enhanced DMA Controller">
            <register-group caption="Enhanced DMA Controller" name="EDMA" size="80">
                <register caption="Control" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Enable" mask="0x80" name="ENABLE"/>
                    <bitfield caption="Software Reset" mask="0x40" name="RESET"/>
                    <bitfield caption="Channel Mode" mask="0x30" name="CHMODE" values="EDMA_CHMODE"/>
                    <bitfield caption="Double Buffer Mode" mask="0x0C" name="DBUFMODE" values="EDMA_DBUFMODE"/>
                    <bitfield caption="Priority Mode" mask="0x03" name="PRIMODE" values="EDMA_PRIMODE"/>
                </register>
                <register caption="Transfer Interrupt Status" name="INTFLAGS" offset="0x03" size="1">
                    <bitfield caption="Channel 3 Transaction Error Interrupt Flag" mask="0x80" name="CH3ERRIF"/>
                    <bitfield caption="Channel 2 Transaction Error Interrupt Flag" mask="0x40" name="CH2ERRIF"/>
                    <bitfield caption="Channel 1 Transaction Error Interrupt Flag" mask="0x20" name="CH1ERRIF"/>
                    <bitfield caption="Channel 0 Transaction Error Interrupt Flag" mask="0x10" name="CH0ERRIF"/>
                    <bitfield caption="Channel 3 Transaction Complete Interrupt Flag" mask="0x08" name="CH3TRNFIF"/>
                    <bitfield caption="Channel 2 Transaction Complete Interrupt Flag" mask="0x04" name="CH2TRNFIF"/>
                    <bitfield caption="Channel 1 Transaction Complete Interrupt Flag" mask="0x02" name="CH1TRNFIF"/>
                    <bitfield caption="Channel 0 Transaction Complete Interrupt Flag" mask="0x01" name="CH0TRNFIF"/>
                </register>
                <register caption="Status" name="STATUS" offset="0x04" size="1">
                    <bitfield caption="Channel 3 Busy Flag" mask="0x80" name="CH3BUSY"/>
                    <bitfield caption="Channel 2 Busy Flag" mask="0x40" name="CH2BUSY"/>
                    <bitfield caption="Channel 1 Busy Flag" mask="0x20" name="CH1BUSY"/>
                    <bitfield caption="Channel 0 Busy Flag" mask="0x10" name="CH0BUSY"/>
                    <bitfield caption="Channel 3 Pending Flag" mask="0x08" name="CH3PEND"/>
                    <bitfield caption="Channel 2 Pending Flag" mask="0x04" name="CH2PEND"/>
                    <bitfield caption="Channel 1 Pending Flag" mask="0x02" name="CH1PEND"/>
                    <bitfield caption="Channel 0 Pending Flag" mask="0x01" name="CH0PEND"/>
                </register>
                <register caption="Temporary Register For 16-bit Access" name="TEMP" offset="0x06" size="1"/>
                <register-group caption="EDMA Channel 0" name="CH0" offset="0x10" name-in-module="EDMA_CH"/>
