bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA8E5.xml
                <register-group caption="EDMA Channel 1" name="CH1" offset="0x20" name-in-module="EDMA_CH"/>
                <register-group caption="EDMA Channel 2" name="CH2" offset="0x30" name-in-module="EDMA_CH"/>
                <register-group caption="EDMA Channel 3" name="CH3" offset="0x40" name-in-module="EDMA_CH"/>
            </register-group>
            <register-group caption="EDMA Channel" name="EDMA_CH" size="16">
                <register caption="Channel Control A" name="CTRLA" offset="0x00" size="1">
                    <bitfield caption="Channel Enable" mask="0x80" name="ENABLE"/>
                    <bitfield caption="Channel Software Reset" mask="0x40" name="RESET"/>
                    <bitfield caption="Channel Repeat Mode" mask="0x20" name="REPEAT"/>
                    <bitfield caption="Channel Transfer Request" mask="0x10" name="TRFREQ"/>
                    <bitfield caption="Channel Single Shot Data Transfer" mask="0x04" name="SINGLE"/>
                    <bitfield caption="Channel 2-bytes Burst Length" mask="0x01" name="BURSTLEN"/>
                </register>
                <register caption="Channel Control" name="CTRLB" offset="0x01" size="1">
                    <bitfield caption="Channel Block Transfer Busy" mask="0x80" name="CHBUSY"/>
                    <bitfield caption="Channel Block Transfer Pending" mask="0x40" name="CHPEND"/>
                    <bitfield caption="Channel Transaction Error Interrupt Flag" mask="0x20" name="ERRIF"/>
                    <bitfield caption="Channel Transaction Complete Interrupt Flag" mask="0x10" name="TRNIF"/>
                    <bitfield caption="Channel Transaction Error Interrupt Level" mask="0x0C" name="ERRINTLVL"
                              values="EDMA_CH_INTLVL"/>
                    <bitfield caption="Channel Transaction Complete Interrupt Level" mask="0x03" name="TRNINTLVL"
                              values="EDMA_CH_INTLVL"/>
                </register>
                <register
                        caption="Memory Address Control for Peripheral Ch., or Source Address Control for Standard Ch."
                        name="ADDRCTRL" offset="0x02" size="1">
                    <bitfield
                            caption="Memory Address Reload for Peripheral Ch., or Source Address Reload for Standard Ch."
                            mask="0x30" name="RELOAD" values="EDMA_CH_RELOAD"/>
                    <bitfield caption="Memory Address Mode for Peripheral Ch., or Source Address Mode for Standard Ch."
                              mask="0x07" name="DIR" values="EDMA_CH_DIR"/>
                </register>
                <register caption="Destination Address Control for Standard Channels Only." name="DESTADDRCTRL"
                          offset="0x03" size="1">
                    <bitfield caption="Destination Address Reload for Standard Channels Only." mask="0x30"
                              name="DESTRELOAD" values="EDMA_CH_RELOAD"/>
                    <bitfield caption="Destination Address Mode for Standard Channels Only." mask="0x07" name="DESTDIR"
                              values="EDMA_CH_DESTDIR"/>
                </register>
                <register caption="Channel Trigger Source" name="TRIGSRC" offset="0x04" size="1">
                    <bitfield caption="Channel Trigger Source" mask="0xFF" name="TRIGSRC" values="EDMA_CH_TRIGSRC"/>
                </register>
                <register
                        caption="Channel Block Transfer Count for Peripheral Ch., or Channel Block Transfer Count Low for Standard Ch."
                        name="TRFCNT" offset="0x06" size="2"/>
                <register
                        caption="Channel Memory Address for Peripheral Ch., or Channel Source Address Low for Standard Ch."
                        name="ADDR" offset="0x08" size="2"/>
                <register caption="Channel Destination Address for Standard Channels Only." name="DESTADDR"
                          offset="0x0C" size="2"/>
            </register-group>
            <value-group caption="Channel mode" name="EDMA_CHMODE">
                <value caption="Channels 0, 1, 2 and 3 in peripheal conf." name="PER0123" value="0x00"/>
                <value caption="Channel 0 in standard conf.; channels 2 and 3 in peripheral conf." name="STD0"
                       value="0x01"/>
                <value caption="Channel 2 in standard conf.; channels 0 and 1 in peripheral conf." name="STD2"
                       value="0x02"/>
                <value caption="Channels 0 and 2 in standard conf." name="STD02" value="0x03"/>
            </value-group>
            <value-group caption="Double buffer mode" name="EDMA_DBUFMODE">
                <value caption="No double buffer enabled" name="DISABLE" value="0x00"/>
                <value caption="Double buffer enabled on peripheral channels 0/1 (if exist) " name="BUF01"
                       value="0x01"/>
                <value caption="Double buffer enabled on peripheral channels 2/3 (if exist)" name="BUF23" value="0x02"/>
                <value caption="Double buffer enabled on peripheral channels 0/1 and 2/3 or standard channels 0/2"
                       name="BUF0123" value="0x03"/>
            </value-group>
            <value-group caption="Priority mode" name="EDMA_PRIMODE">
                <value caption="Round robin on all channels" name="RR0123" value="0x00"/>
                <value caption="Ch0 &gt; round robin (Ch 1 ch2 Ch3)" name="RR123" value="0x01"/>
                <value caption="Ch0 &gt; Ch 1 &gt; round robin (Ch2 Ch3)" name="RR23" value="0x02"/>
                <value caption="Ch0 &gt; Ch1 &gt; Ch2 &gt; Ch3 " name="CH0123" value="0x03"/>
            </value-group>
            <value-group caption="Memory Address Reload for Peripheral Ch., or Source Address Reload for Standard Ch."
                         name="EDMA_CH_RELOAD">
                <value caption="No reload" name="NONE" value="0x00"/>
                <value caption="Reload at end of each block transfer" name="BLOCK" value="0x01"/>
                <value caption="Reload at end of each burst transfer" name="BURST" value="0x02"/>
                <value caption="Reload at end of each transaction" name="TRANSACTION" value="0x03"/>
            </value-group>
            <value-group caption="Memory Address Mode for Peripheral Ch., or Source Address Mode for Standard Ch."
                         name="EDMA_CH_DIR">
                <value caption="Fixed" name="FIXED" value="0x00"/>
                <value caption="Increment" name="INC" value="0x01"/>
                <value caption="If Peripheral Ch. (Per ==&gt; Mem), 1-byte 'mask-match' (data: ADDRL, mask: ADDRH), else reserved conf. "
                       name="MP1" value="0x04"/>
                <value caption="If Peripheral Ch. (Per ==&gt; Mem), 1-byte 'OR-match' (data-1: ADDRL OR data-2: ADDRH), else reserved conf. "
                       name="MP2" value="0x05"/>
                <value caption="If Peripheral Ch. (Per ==&gt; Mem), 2-byte 'match' (data-1: ADDRL followed by data-2: ADDRH), else reserved conf. "
                       name="MP3" value="0x06"/>
            </value-group>
            <value-group caption="Destination addressing mode" name="EDMA_CH_DESTDIR">
                <value caption="Fixed" name="FIXED" value="0x00"/>
                <value caption="Increment" name="INC" value="0x01"/>
                <value caption="1-byte 'mask-match' (data: ADDRL, mask: ADDRH)" name="MP1" value="0x04"/>
                <value caption="1-byte 'OR-match' (data-1: ADDRL OR data-2: ADDRH)" name="MP2" value="0x05"/>
                <value caption="2-byte 'match' (data1: ADDRL followed by data2: ADDRH)" name="MP3" value="0x06"/>
            </value-group>
