bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA8E5.xml
        <module name="ADC" id="I6110" version="XMEGAE" caption="Analog/Digital Converter">
            <register-group caption="ADC Channel" name="ADC_CH" size="16">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Channel Start Conversion" mask="0x80" name="START"/>
                    <bitfield caption="Gain Factor" mask="0x1C" name="GAIN" values="ADC_CH_GAIN"/>
                    <bitfield caption="Input Mode Select" mask="0x03" name="INPUTMODE" values="ADC_CH_INPUTMODE"/>
                </register>
                <register caption="MUX Control" name="MUXCTRL" offset="0x01" size="1">
                    <bitfield caption="MUX selection on Positive ADC Input" mask="0x78" name="MUXPOS"
                              values="ADC_CH_MUXPOS"/>
                    <bitfield caption="MUX selection on Internal ADC Input" mask="0x78" name="MUXINT"
                              values="ADC_CH_MUXINT"/>
                    <bitfield caption="MUX selection on Negative ADC Input" mask="0x07" name="MUXNEG"
                              values="ADC_CH_MUXNEG"/>
                </register>
                <register caption="Channel Interrupt Control Register" name="INTCTRL" offset="0x02" size="1">
                    <bitfield caption="Interrupt Mode" mask="0x0C" name="INTMODE" values="ADC_CH_INTMODE"/>
                    <bitfield caption="Interrupt Level" mask="0x03" name="INTLVL" values="ADC_CH_INTLVL"/>
                </register>
                <register caption="Interrupt Flags" name="INTFLAGS" offset="0x03" size="1">
                    <bitfield caption="Channel Interrupt Flag" mask="0x01" name="IF"/>
                </register>
                <register caption="Channel Result" name="RES" offset="0x04" size="2"/>
                <register caption="Input Channel Scan" name="SCAN" offset="0x06" size="1">
                    <bitfield caption="Positive MUX Setting Offset" mask="0xF0" name="INPUTOFFSET"/>
                    <bitfield caption="Number of Channels Included in Scan" mask="0x0F" name="INPUTSCAN"/>
                </register>
                <register caption="Correction Control Register" name="CORRCTRL" offset="0x07" size="1">
                    <bitfield caption="Correction Enable" mask="0x01" name="CORREN"/>
                </register>
                <register caption="Offset Correction Register 0" name="OFFSETCORR0" offset="0x08" size="1"/>
                <register caption="Offset Correction Register 1" name="OFFSETCORR1" offset="0x09" size="1">
                    <bitfield caption="Offset Correction Byte 1" mask="0x0F" name="OFFSETCORR"/>
                </register>
                <register caption="Gain Correction Register 0" name="GAINCORR0" offset="0x0A" size="1"/>
                <register caption="Gain Correction Register 1" name="GAINCORR1" offset="0x0B" size="1">
                    <bitfield caption="Gain Correction Byte 1" mask="0x0F" name="GAINCORR"/>
                </register>
                <register caption="Average Control Register" name="AVGCTRL" offset="0x0C" size="1">
                    <bitfield caption="Right Shift" mask="0x70" name="RIGHTSHIFT"/>
                    <bitfield caption="Averaged Number of Samples" mask="0x0F" name="SAMPNUM" values="ADC_SAMPNUM"/>
                </register>
            </register-group>
            <register-group caption="Analog-to-Digital Converter" name="ADC" size="48">
                <register caption="Control Register A" name="CTRLA" offset="0x00" size="1">
                    <bitfield caption="Start Conversion" mask="0x04" name="START"/>
                    <bitfield caption="ADC Flush" mask="0x02" name="FLUSH"/>
                    <bitfield caption="Enable ADC" mask="0x01" name="ENABLE"/>
                </register>
                <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
                    <bitfield caption="Current Limitation" mask="0x60" name="CURRLIMIT" values="ADC_CURRLIMIT"/>
                    <bitfield caption="Conversion Mode" mask="0x10" name="CONMODE"/>
                    <bitfield caption="Free Running Mode Enable" mask="0x08" name="FREERUN"/>
                    <bitfield caption="Result Resolution" mask="0x06" name="RESOLUTION" values="ADC_RESOLUTION"/>
                </register>
                <register caption="Reference Control" name="REFCTRL" offset="0x02" size="1">
                    <bitfield caption="Reference Selection" mask="0x70" name="REFSEL" values="ADC_REFSEL"/>
                    <bitfield caption="Bandgap enable" mask="0x02" name="BANDGAP"/>
                    <bitfield caption="Temperature Reference Enable" mask="0x01" name="TEMPREF"/>
                </register>
                <register caption="Event Control" name="EVCTRL" offset="0x03" size="1">
                    <bitfield caption="Event Input Select" mask="0x38" name="EVSEL" values="ADC_EVSEL"/>
                    <bitfield caption="Event Action Select" mask="0x07" name="EVACT" values="ADC_EVACT"/>
                </register>
                <register caption="Clock Prescaler" name="PRESCALER" offset="0x04" size="1">
                    <bitfield caption="Clock Prescaler Selection" mask="0x07" name="PRESCALER" values="ADC_PRESCALER"/>
                </register>
                <register caption="Interrupt Flags" name="INTFLAGS" offset="0x06" size="1">
                    <bitfield caption="Channel 0 Interrupt Flag" mask="0x01" name="CH0IF"/>
                </register>
                <register caption="Temporary Register" name="TEMP" offset="0x07" size="1"/>
                <register caption="ADC Sampling Time Control Register" name="SAMPCTRL" offset="0x08" size="1">
                    <bitfield caption="Sampling time control register" mask="0x03F" name="SAMPVAL"/>
                </register>
                <register caption="Calibration Value" name="CAL" offset="0x0C" size="1"/>
                <register caption="Channel 0 Result" name="CH0RES" offset="0x10" size="2"/>
                <register caption="Compare Value" name="CMP" offset="0x18" size="2"/>
                <register-group caption="ADC Channel 0" name="CH0" offset="0x20" name-in-module="ADC_CH"/>
            </register-group>
