bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA8E5.xml
        <module name="RTC" id="I6093" version="XMEGAE" caption="Real-Time Clounter">
            <register-group caption="Real-Time Counter" name="RTC" size="14">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Correction Enable" mask="0x08" name="CORREN"/>
                    <bitfield caption="Prescaling Factor" mask="0x07" name="PRESCALER" values="RTC_PRESCALER"/>
                </register>
                <register caption="Status Register" name="STATUS" offset="0x01" size="1">
                    <bitfield caption="Synchronization Busy Flag" mask="0x01" name="SYNCBUSY"/>
                </register>
                <register caption="Interrupt Control Register" name="INTCTRL" offset="0x02" size="1">
                    <bitfield caption="Compare Match Interrupt Level" mask="0x0C" name="COMPINTLVL"
                              values="RTC_COMPINTLVL"/>
                    <bitfield caption="Overflow Interrupt Level" mask="0x03" name="OVFINTLVL" values="RTC_OVFINTLVL"/>
                </register>
                <register caption="Interrupt Flags" name="INTFLAGS" offset="0x03" size="1">
                    <bitfield caption="Compare Match Interrupt Flag" mask="0x02" name="COMPIF"/>
                    <bitfield caption="Overflow Interrupt Flag" mask="0x01" name="OVFIF"/>
                </register>
                <register caption="Temporary register" name="TEMP" offset="0x04" size="1"/>
                <register caption="Calibration Register" name="CALIB" offset="0x06" size="1">
                    <bitfield caption="Correction Sign" mask="0x80" name="SIGN"/>
                    <bitfield caption="Error Value" mask="0x7F" name="ERROR"/>
                </register>
                <register caption="Count Register" name="CNT" offset="0x08" size="2"/>
                <register caption="Period Register" name="PER" offset="0x0A" size="2"/>
                <register caption="Compare Register" name="COMP" offset="0x0C" size="2"/>
            </register-group>
            <value-group caption="Prescaler Factor" name="RTC_PRESCALER">
                <value caption="RTC Off" name="OFF" value="0x00"/>
                <value caption="RTC Clock" name="DIV1" value="0x01"/>
                <value caption="RTC Clock / 2" name="DIV2" value="0x02"/>
                <value caption="RTC Clock / 8" name="DIV8" value="0x03"/>
                <value caption="RTC Clock / 16" name="DIV16" value="0x04"/>
                <value caption="RTC Clock / 64" name="DIV64" value="0x05"/>
                <value caption="RTC Clock / 256" name="DIV256" value="0x06"/>
                <value caption="RTC Clock / 1024" name="DIV1024" value="0x07"/>
            </value-group>
            <value-group caption="Compare Interrupt level" name="RTC_COMPINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Overflow Interrupt level" name="RTC_OVFINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <interrupt-group name="RTC">
                <interrupt index="0" name="OVF" caption="Overflow Interrupt"/>
                <interrupt index="1" name="COMP" caption="Compare Interrupt"/>
            </interrupt-group>
        </module>
        <module name="XCL" id="I3008" caption="XMEGA Custom Logic">
            <register-group caption="XMEGA Custom Logic" name="XCL" size="16">
                <register caption="Control Register A" name="CTRLA" offset="0x00" size="1">
                    <bitfield caption="LUT0 Output Enable" mask="0xC0" name="LUT0OUTEN" values="XCL_LUT0OUTEN"/>
                    <bitfield caption="Port Selection" mask="0x30" name="PORTSEL" values="XCL_PORTSEL"/>
                    <bitfield caption="LUT Configuration" mask="0x07" name="LUTCONF" values="XCL_LUTCONF"/>
                </register>
                <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
                    <bitfield caption="Input Selection 3" mask="0xC0" name="IN3SEL" values="XCL_INSEL"/>
                    <bitfield caption="Input Selection 2" mask="0x30" name="IN2SEL" values="XCL_INSEL"/>
                    <bitfield caption="Input Selection 1" mask="0x0C" name="IN1SEL" values="XCL_INSEL"/>
                    <bitfield caption="Input Selection 0" mask="0x03" name="IN0SEL" values="XCL_INSEL"/>
                </register>
                <register caption="Control Register C" name="CTRLC" offset="0x02" size="1">
                    <bitfield caption="Asynchronous Event Line Selection for LUT1" mask="0x80" name="EVASYSEL1"/>
                    <bitfield caption="Asynchronous Event Line Selection for LUT0" mask="0x40" name="EVASYSEL0"/>
                    <bitfield caption="Delay Selection" mask="0x30" name="DLYSEL" values="XCL_DLYSEL"/>
                    <bitfield caption="Delay Configuration on LUT1" mask="0x0C" name="DLY1CONF" values="XCL_DLYCONF"/>
                    <bitfield caption="Delay Configuration on LUT0" mask="0x03" name="DLY0CONF" values="XCL_DLYCONF"/>
                </register>
                <register caption="Control Register D" name="CTRLD" offset="0x03" size="1">
                    <bitfield caption="Truth Table of LUT1" mask="0xF0" name="TRUTH1"/>
                    <bitfield caption="Truth Table of LUT0" mask="0x0F" name="TRUTH0"/>
                </register>
                <register caption="Control Register E" name="CTRLE" offset="0x04" size="1">
                    <bitfield caption="Timer/Counter Command Selection" mask="0x80" name="CMDSEL" values="XCL_CMDSEL"/>
                    <bitfield caption="Timer/Counter Selection" mask="0x70" name="TCSEL" values="XCL_TCSEL"/>
                    <bitfield caption="Clock Selection" mask="0x0F" name="CLKSEL" values="XCL_CLKSEL"/>
                </register>
                <register caption="Control Register F" name="CTRLF" offset="0x05" size="1">
                    <bitfield caption="Command Enable" mask="0xC0" name="CMDEN" values="XCL_CMDEN"/>
                    <bitfield caption="Compare Channel 1 Output Value" mask="0x20" name="CMP1" values="XCL_CMPEN"/>
                    <bitfield caption="Compare Channel 0 Output Value" mask="0x10" name="CMP0" values="XCL_CMPEN"/>
                    <bitfield caption="Compare or Capture Channel 1 Enable" mask="0x08" name="CCEN1"/>
                    <bitfield caption="Compare or Capture Channel 0 Enable" mask="0x04" name="CCEN0"/>
                    <bitfield caption="Timer/Counter Mode" mask="0x03" name="MODE" values="XCL_TCMODE"/>
                </register>
