bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA8E5.xml
                <register caption="Control Register G Set" name="CTRLGSET" offset="0x09" size="1">
                    <bitfield caption="Timer/Counter Stop" mask="0x20" name="STOP"/>
                    <bitfield caption="Command" mask="0x0C" name="CMD" values="TC45_CMD"/>
                    <bitfield caption="Lock Update" mask="0x02" name="LUPD"/>
                    <bitfield caption="Counter Direction" mask="0x01" name="DIR"/>
                </register>
                <register caption="Control Register H Clear" name="CTRLHCLR" offset="0x0A" size="1">
                    <bitfield caption="Channel D Compare or Capture Buffer Valid" mask="0x10" name="CCDBV"/>
                    <bitfield caption="Channel C Compare or Capture Buffer Valid" mask="0x08" name="CCCBV"/>
                    <bitfield caption="Channel B Compare or Capture Buffer Valid" mask="0x04" name="CCBBV"/>
                    <bitfield caption="Channel A Compare or Capture Buffer Valid" mask="0x02" name="CCABV"/>
                    <bitfield caption="Period Buffer Valid" mask="0x01" name="PERBV"/>
                    <bitfield caption="Channel Low D Compare or Capture Buffer Valid" mask="0x10" name="LCCDBV"/>
                    <bitfield caption="Channel Low C Compare or Capture Buffer Valid" mask="0x08" name="LCCCBV"/>
                    <bitfield caption="Channel Low B Compare or Capture Buffer Valid" mask="0x04" name="LCCBBV"/>
                    <bitfield caption="Channel Low A Compare or Capture Buffer Valid" mask="0x02" name="LCCABV"/>
                    <bitfield caption="Period Low Buffer Valid" mask="0x01" name="LPERBV"/>
                </register>
                <register caption="Control Register H Set" name="CTRLHSET" offset="0x0B" size="1">
                    <bitfield caption="Channel D Compare or Capture Buffer Valid" mask="0x10" name="CCDBV"/>
                    <bitfield caption="Channel C Compare or Capture Buffer Valid" mask="0x08" name="CCCBV"/>
                    <bitfield caption="Channel B Compare or Capture Buffer Valid" mask="0x04" name="CCBBV"/>
                    <bitfield caption="Channel A Compare or Capture Buffer Valid" mask="0x02" name="CCABV"/>
                    <bitfield caption="Period Buffer Valid" mask="0x01" name="PERBV"/>
                    <bitfield caption="Channel Low D Compare or Capture Buffer Valid" mask="0x10" name="LCCDBV"/>
                    <bitfield caption="Channel Low C Compare or Capture Buffer Valid" mask="0x08" name="LCCCBV"/>
                    <bitfield caption="Channel Low B Compare or Capture Buffer Valid" mask="0x04" name="LCCBBV"/>
                    <bitfield caption="Channel Low A Compare or Capture Buffer Valid" mask="0x02" name="LCCABV"/>
                    <bitfield caption="Period Low Buffer Valid" mask="0x01" name="LPERBV"/>
                </register>
                <register caption="Interrupt Flag Register" name="INTFLAGS" offset="0x0C" size="1">
                    <bitfield caption="Channel D Compare or Capture Interrupt Flag" mask="0x80" name="CCDIF"/>
                    <bitfield caption="Channel C Compare or Capture Interrupt Flag" mask="0x40" name="CCCIF"/>
                    <bitfield caption="Channel B Compare or Capture Interrupt Flag" mask="0x20" name="CCBIF"/>
                    <bitfield caption="Channel A Compare or Capture Interrupt Flag" mask="0x10" name="CCAIF"/>
                    <bitfield caption="Trigger Restart Interrupt Flag" mask="0x04" name="TRGIF"/>
                    <bitfield caption="Error Interrupt Flag" mask="0x02" name="ERRIF"/>
                    <bitfield caption="Overflow/Underflow Interrupt Flag" mask="0x01" name="OVFIF"/>
                    <bitfield caption="Channel Low D Compare or Capture Interrupt Flag" mask="0x80" name="LCCDIF"/>
                    <bitfield caption="Channel Low C Compare or Capture Interrupt Flag" mask="0x40" name="LCCCIF"/>
                    <bitfield caption="Channel Low B Compare or Capture Interrupt Flag" mask="0x20" name="LCCBIF"/>
                    <bitfield caption="Channel Low A Compare or Capture Interrupt Flag" mask="0x10" name="LCCAIF"/>
                </register>
                <register caption="Temporary Register For 16-bit Access" name="TEMP" offset="0x0F" size="1"/>
                <register caption="Count" name="CNT" offset="0x20" size="2"/>
                <register caption="Period" name="PER" offset="0x26" size="2"/>
                <register caption="Compare or Capture A" name="CCA" offset="0x28" size="2"/>
                <register caption="Compare or Capture B" name="CCB" offset="0x2A" size="2"/>
                <register caption="Compare or Capture C" name="CCC" offset="0x2C" size="2"/>
                <register caption="Compare or Capture D" name="CCD" offset="0x2E" size="2"/>
                <register caption="Period Buffer" name="PERBUF" offset="0x36" size="2"/>
                <register caption="Compare Or Capture A Buffer" name="CCABUF" offset="0x38" size="2"/>
                <register caption="Compare Or Capture B Buffer" name="CCBBUF" offset="0x3A" size="2"/>
                <register caption="Compare Or Capture C Buffer" name="CCCBUF" offset="0x3C" size="2"/>
                <register caption="Compare Or Capture D Buffer" name="CCDBUF" offset="0x3E" size="2"/>
            </register-group>
            <register-group caption="16-bit Timer/Counter 5" name="TC5" size="64">
                <register caption="Control Register A" name="CTRLA" offset="0x00" size="1">
                    <bitfield caption="Synchronization Enabled" mask="0x40" name="SYNCHEN"/>
                    <bitfield caption="Start on Next Event" mask="0x20" name="EVSTART"/>
                    <bitfield caption="Stop on Next Update" mask="0x10" name="UPSTOP"/>
                    <bitfield caption="Clock Select" mask="0x0F" name="CLKSEL" values="TC45_CLKSEL"/>
                </register>
                <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
                    <bitfield caption="Byte Mode" mask="0xC0" name="BYTEM" values="TC45_BYTEM"/>
                    <bitfield caption="Circular Buffer Enable" mask="0x30" name="CIRCEN" values="TC45_CIRCEN"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x07" name="WGMODE" values="TC45_WGMODE"/>
                </register>
