bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA8E5.xml
                <register caption="Control Register G Clear" name="CTRLGCLR" offset="0x06" size="1">
                    <bitfield caption="State B Clear" mask="0x80" name="HALTBCLR"/>
                    <bitfield caption="State A Clear" mask="0x40" name="HALTACLR"/>
                    <bitfield caption="State E Clear" mask="0x20" name="STATEECLR"/>
                    <bitfield caption="Fault B Flag" mask="0x04" name="FAULTB"/>
                    <bitfield caption="Fault A Flag" mask="0x02" name="FAULTA"/>
                    <bitfield caption="Fault E Flag" mask="0x01" name="FAULTE"/>
                </register>
                <register caption="Control Register G set" name="CTRLGSET" offset="0x07" size="1">
                    <bitfield caption="Software Fault B" mask="0x80" name="FAULTBSW"/>
                    <bitfield caption="Software Fault A" mask="0x40" name="FAULTASW"/>
                    <bitfield caption="Software Fault E" mask="0x20" name="FAULTESW"/>
                    <bitfield caption="Channel index Command" mask="0x18" name="IDXCMD" values="FAULT_IDXCMD"/>
                </register>
            </register-group>
            <value-group caption="Ramp Mode Selection" name="FAULT_RAMP">
                <value caption="Normal Mode" name="RAMP1" value="0x00"/>
                <value caption="RAMP2 Mode" name="RAMP2" value="0x02"/>
            </value-group>
            <value-group caption="Fault E Input Source Selection" name="FAULT_SRCE">
                <value caption="Fault Protection Disabled" name="DISABLE" value="0x00"/>
                <value caption="Event Channel n" name="CHN" value="0x01"/>
                <value caption="Event Channel n+1" name="CHN1" value="0x02"/>
                <value caption="Event Channel n+2" name="CHN2" value="0x03"/>
            </value-group>
            <value-group caption="Fault A Halt Action Selection" name="FAULT_HALTA">
                <value caption="Halt Action Disabled" name="DISABLE" value="0x00"/>
                <value caption="Hardware Halt Action" name="HW" value="0x01"/>
                <value caption="Software Halt Action" name="SW" value="0x02"/>
            </value-group>
            <value-group caption="Fault A Source Selection" name="FAULT_SRCA">
                <value caption="Fault A Disabled" name="DISABLE" value="0x00"/>
                <value caption="Event Channel n" name="CHN" value="0x01"/>
                <value caption="Event Channel n+1" name="CHN1" value="0x02"/>
                <value caption="Fault A linked to Fault B State from previous cycle" name="LINK" value="0x03"/>
            </value-group>
            <value-group caption="Fault B Halt Action Selection" name="FAULT_HALTB">
                <value caption="Halt Action Disabled" name="DISABLE" value="0x00"/>
                <value caption="Hardware Halt Action" name="HW" value="0x01"/>
                <value caption="Software Halt Action" name="SW" value="0x02"/>
            </value-group>
            <value-group caption="Fault B Source Selection" name="FAULT_SRCB">
                <value caption="Fault B disabled" name="DISABLE" value="0x00"/>
                <value caption="Event Channel n" name="CHN" value="0x01"/>
                <value caption="Event Channel n+1" name="CHN1" value="0x02"/>
                <value caption="Fault B linked to Fault A State from previous cycle" name="LINK" value="0x03"/>
            </value-group>
            <value-group caption="Channel index Command" name="FAULT_IDXCMD">
                <value caption="Command Disabled" name="DISABLE" value="0x00"/>
                <value caption="Force Cycle B in Next Cycle" name="SET" value="0x01"/>
                <value caption="Force Cycle A in Next Cycle" name="CLEAR" value="0x02"/>
                <value caption="Hold Current Cycle Index in Next Cycle " name="HOLD" value="0x03"/>
            </value-group>
        </module>
        <module name="WEX" id="I3007" version="XMEGAE" caption="Waveform Extension">
            <register-group caption="Waveform Extension" name="WEX" size="16">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Update Source Selection" mask="0x80" name="UPSEL"/>
                    <bitfield caption="Output Matrix" mask="0x70" name="OTMX" values="WEX_OTMX"/>
                    <bitfield caption="Dead-Time Insertion Generator 3 Enable" mask="0x08" name="DTI3EN"/>
                    <bitfield caption="Dead-Time Insertion Generator 2 Enable" mask="0x04" name="DTI2EN"/>
                    <bitfield caption="Dead-Time Insertion Generator 1 Enable" mask="0x02" name="DTI1EN"/>
                    <bitfield caption="Dead-Time Insertion Generator 0 Enable" mask="0x01" name="DTI0EN"/>
                </register>
                <register caption="Dead-time Concurrent Write to Both Sides Register" name="DTBOTH" offset="0x01"
                          size="1"/>
                <register caption="Dead-time Low Side Register" name="DTLS" offset="0x02" size="1"/>
                <register caption="Dead-time High Side Register" name="DTHS" offset="0x03" size="1"/>
                <register caption="Status Clear Register" name="STATUSCLR" offset="0x04" size="1">
                    <bitfield caption="Swap Buffer Valid " mask="0x04" name="SWAPBUF"/>
                    <bitfield caption="Pattern Generator Value Buffer Valid " mask="0x02" name="PGVBUFV"/>
                    <bitfield caption="Pattern Generator Overwrite Buffer Valid" mask="0x01" name="PGOBUFV"/>
                </register>
                <register caption="Status Set Register" name="STATUSSET" offset="0x05" size="1">
                    <bitfield caption="Swap Buffer Valid " mask="0x04" name="SWAPBUF"/>
                    <bitfield caption="Pattern Generator Value Buffer Valid " mask="0x02" name="PGVBUFV"/>
                    <bitfield caption="Pattern Generator Overwrite Buffer Valid " mask="0x01" name="PGOBUFV"/>
                </register>
                <register caption="Swap Register" name="SWAP" offset="0x06" size="1">
                    <bitfield caption="Swap DTI output pair 3" mask="0x08" name="SWAP3"/>
                    <bitfield caption="Swap DTI output pair 2" mask="0x04" name="SWAP2"/>
                    <bitfield caption="Swap DTI output pair 1" mask="0x02" name="SWAP1"/>
                    <bitfield caption="Swap DTI output pair 0" mask="0x01" name="SWAP0"/>
                </register>
                <register caption="Pattern Generation Override Register" name="PGO" offset="0x07" size="1"/>
                <register caption="Pattern Generation Value Register" name="PGV" offset="0x08" size="1"/>
                <register caption="Dead Time Low Side Buffer" name="SWAPBUF" offset="0x0A" size="1">
                    <bitfield caption="Swap DTI output pair 3 " mask="0x08" name="SWAP3BUF"/>
                    <bitfield caption="Swap DTI output pair 2" mask="0x04" name="SWAP2BUF"/>
                    <bitfield caption="Swap DTI output pair 1 " mask="0x02" name="SWAP1BUF"/>
                    <bitfield caption="Swap DTI output pair 0" mask="0x01" name="SWAP0BUF"/>
                </register>
